export const MILITARY_UNITS: Record<string, Record<string, string[]>> = {
  '육군 지상작전사령부': {
    '수도군단': ['제17보병사단', '제51보병사단', '제55보병사단', '수도포병여단'],
    '제1군단': ['제1보병사단', '제9보병사단', '제25보병사단', '제1포병여단', '제1공병여단'],
    '제2군단': ['제7보병사단', '제15보병사단', '제27보병사단', '제2포병여단', '제2공병여단'],
    '제3군단': ['제12보병사단', '제21보병사단', '제3포병여단', '제3공병여단'],
    '제5군단': ['제3보병사단', '제6보병사단', '제5포병여단', '제5공병여단'],
    '제7기동군단': ['수도기계화보병사단', '제8기동사단', '제11기동사단', '제7포병여단'],
    '제8군단': ['제22보병사단', '제23보병사단', '제8포병여단']
  },
  '육군 제2작전사령부': {
    '제31보병사단': ['93여단', '95여단', '96여단'],
    '제32보병사단': ['97여단', '98여단', '99여단'],
    '제35보병사단': ['103여단', '105여단', '106여단'],
    '제37보병사단': ['110여단', '111여단', '112여단'],
    '제39보병사단': ['117여단', '118여단', '119여단'],
    '제50보병사단': ['120여단', '121여단', '122여단'],
    '제53보병사단': ['125여단', '126여단']
  },
  '육군 수도방위사령부': {
    '제10방공단': ['1중대', '2중대', '3중대', '단본부중대'],
    '제1경비단': ['본부중대', '1중대', '2중대', '3중대'],
    '제55경비단': ['본부중대', '1중대', '2중대', '3중대'],
    '제52보병사단': ['210여단', '212여단', '213여단'],
    '제56보병사단': ['218여단', '219여단', '220여단']
  },
  '육군 특수전사령부': {
    '제1공수특전여단': ['1대대', '2대대', '3대대', '4대대'],
    '제3공수특전여단': ['11대대', '12대대', '13대대', '14대대'],
    '제7공수특전여단': ['31대대', '32대대', '33대대', '34대대'],
    '제9공수특전여단': ['51대대', '52대대', '53대대', '54대대'],
    '제11공수특전여단': ['61대대', '62대대', '63대대', '64대대'],
    '제13특수임무여단': ['71대대', '72대대', '73대대', '74대대'],
    '국제평화지원단': ['본부대', '파병준비단']
  },
  '해군작전사령부': {
    '제1함대': ['제11구축함전대', '제12초계함전대', '제13고속정전대'],
    '제2함대': ['제21구축함전대', '제22초계함전대', '제23고속정전대'],
    '제3함대': ['제31구축함전대', '제32초계함전대', '제33고속정전대'],
    '잠수함사령부': ['제91잠수함전대', '제92잠수함전대', '제93잠수함전대'],
    '항공사령부': ['제61해상초계기전대', '제62해상작전헬기전대', '제63해상기동헬기전대']
  },
  '해병대사령부': {
    '제1해병사단': ['제2해병여단', '제3해병여단', '제7해병여단', '포병여단'],
    '제2해병사단': ['제1해병여단', '제5해병여단', '제8해병여단', '포병여단'],
    '제6해병여단': ['61대대', '62대대', '63대대'],
    '제9해병여단': ['91대대', '92대대', '93대대'],
    '연평부대': ['90보병대대', '포병대대']
  },
  '공군작전사령부': {
    '공중전투사령부': ['제1전투비행단', '제8전투비행단', '제10전투비행단', '제11전투비행단', '제16전투비행단', '제18전투비행단', '제19전투비행단', '제20전투비행단', '제38전투비행전대'],
    '공중기동정찰사령부': ['제3훈련비행단', '제5공중기동비행단', '제15특수임무비행단', '제39정찰비행단'],
    '방공관제사령부': ['제1방공관제전대', '제2방공관제전대', '제3방공관제전대', '제4방공관제전대'],
    '방공유도탄사령부': ['제1방공유도탄여단', '제2방공유도탄여단', '제3방공유도탄여단']
  },
  '국방부 직할부대': {
    '국군지휘통신사령부': ['제1정보통신단', '제2정보통신단', '제3정보통신단'],
    '국군의무사령부': ['국군수도병원', '국군대전병원', '국군양주병원', '국군포천병원', '국군춘천병원'],
    '국군수송사령부': ['항만운영단', '철도수송지원단', '호송대대'],
    '국군방첩사령부': ['본부근무대', '지역방첩대'],
    '국군화생방방호사령부': ['제21화생방대대', '제22화생방대대', '제23화생방대대', '제24화생방대대']
  }
};
